itsmejay18/Piso-Power-Station-Project-ESP32-IOT/byg_pisotab_esp8266/build/esp8266.esp8266.nodemcuv2/sketch/byg_pisotab_esp8266.ino.cpp
#include <Arduino.h>
#line 1 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <LittleFS.h>

static const char* BOARD_NAME = "ESP8266_NODEMCU_ESP12E";
static const char* AP_SSID = "BYG-PISOTAB-SETUP";
static const char* AP_PASS = "12345678";
static const char* CONFIG_PATH = "/config.json";
static const unsigned long STA_TIMEOUT_MS = 20000;
static const unsigned long ALLAN_TRIGGER_DEBOUNCE_MS = 80;
static const char* DEFAULT_RELAY_PIN_NAME = "D1";
static const char* DEFAULT_TRIGGER_PIN_NAME = "D2";

IPAddress AP_IP(10, 20, 30, 1);
IPAddress AP_GATEWAY(10, 20, 30, 1);
IPAddress AP_SUBNET(255, 255, 255, 0);

ESP8266WebServer server(80);

struct PinOption {
  const char* name;
  uint8_t gpio;
};

PinOption SAFE_PIN_OPTIONS[] = {
  {"D1", D1},
  {"D2", D2},
  {"D5", D5},
  {"D6", D6},
  {"D7", D7}
};

struct WifiConfig {
  String ssid;
  String password;
  bool useDhcp = false;
  String staticIp;
  String gateway;
  String subnet;
  String dns1;
  String dns2;
  String adminPassword = "admin";
  String relayPinName = DEFAULT_RELAY_PIN_NAME;
  String triggerPinName = DEFAULT_TRIGGER_PIN_NAME;
  bool relayActiveLow = true;
  bool triggerActiveLow = true;
};

WifiConfig config;
String currentMode = "AP";
String currentIp = "10.20.30.1";
String currentSsid = "";
unsigned long bootMs = 0;
bool rebootPending = false;
unsigned long rebootAtMs = 0;
int batteryPercent = -1;
int chargeOnPercent = 40;
int chargeOffPercent = 90;
bool charging = false;
bool allanTriggerActive = false;
bool allanRawActive = false;
unsigned long allanRawChangedMs = 0;

#line 64 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String jsonEscape(const String& value);
#line 83 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String readJsonString(const String& json, const String& key);
#line 114 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
int readJsonInt(const String& json, const String& key, int fallback);
#line 132 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool readJsonBool(const String& json, const String& key, bool fallback);
#line 150 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String requestValue(const String& key);
#line 156 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool requestBool(const String& key, bool fallback);
#line 163 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String normalizePinName(String value, const String& fallback);
#line 172 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
uint8_t gpioForPinName(const String& pinName, uint8_t fallback);
#line 179 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
int relayOnLevel();
#line 183 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
int relayOffLevel();
#line 187 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
int triggerActiveLevel();
#line 191 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
uint8_t relayGpio();
#line 195 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
uint8_t triggerGpio();
#line 199 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void sanitizePinConfig();
#line 208 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool loadConfig();
#line 238 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool saveConfig();
#line 262 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void scheduleReboot(unsigned long delayMs);
#line 267 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String uptimeText();
#line 285 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String contentTypeFor(const String& path);
#line 296 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool serveFile(String path);
#line 307 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void sendJson(int status, const String& body);
#line 312 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void startApMode();
#line 324 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool applyStaticConfig();
#line 339 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool isValidIpString(const String& value);
#line 344 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
uint32_t ipToUint32(const IPAddress& ip);
#line 348 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String derivePortalIpFromGateway(const String& gatewayValue);
#line 362 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool isValidSubnetMaskString(const String& value);
#line 371 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool isSameSubnet(const String& localValue, const String& gatewayValue, const String& subnetValue);
#line 382 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void startStaOrFallback();
#line 408 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
bool readAllanTriggerRaw();
#line 412 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void updateAllanTrigger();
#line 425 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleStatus();
#line 450 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String chargingStatusJson();
#line 464 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void turnChargingOn();
#line 471 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void turnChargingOff();
#line 478 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void smartChargingLogic();
#line 488 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleBattery();
#line 513 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleApiBattery();
#line 517 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleChargingSettings();
#line 532 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleChargeApi();
#line 554 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleChargingStatus();
#line 558 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleScan();
#line 582 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleLogin();
#line 594 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handlePasswordChange();
#line 617 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handlePins();
#line 660 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleSettings();
#line 713 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleReboot();
#line 719 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void handleReset();
#line 726 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void configureIoPins();
#line 742 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void setupRoutes();
#line 763 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void setup();
#line 787 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
void loop();
#line 64 "C:\\Users\\Jay\\Documents\\GitHub\\Piso Tab Custom App\\firmware\\byg_pisotab_esp8266\\byg_pisotab_esp8266.ino"
String jsonEscape(const String& value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    char c = value.charAt(i);
    if (c == '"' || c == '\\') {
      out += '\\';
      out += c;
    } else if (c == '\n') {
      out += "\\n";
    } else if (c == '\r') {
      out += "\\r";
    } else {
      out += c;
    }
  }
  return out;
}

