itsmejay18/Piso-Power-Station-Project-ESP32-IOT/byg_pisotab_esp8266/build/esp8266.esp8266.nodemcuv2/sketch/byg_pisotab_esp8266.ino.cpp
String readJsonString(const String& json, const String& key) {
  String needle = "\"" + key + "\"";
  int keyPos = json.indexOf(needle);
  if (keyPos < 0) return "";
  int colon = json.indexOf(':', keyPos + needle.length());
  if (colon < 0) return "";
  int start = colon + 1;
  while (start < (int)json.length() && isspace(json.charAt(start))) start++;
  if (start >= (int)json.length() || json.charAt(start) != '"') return "";
  start++;

  String out;
  bool escaped = false;
  for (int i = start; i < (int)json.length(); i++) {
    char c = json.charAt(i);
    if (escaped) {
      if (c == 'n') out += '\n';
      else if (c == 'r') out += '\r';
      else out += c;
      escaped = false;
    } else if (c == '\\') {
      escaped = true;
    } else if (c == '"') {
      break;
    } else {
      out += c;
    }
  }
  return out;
}

int readJsonInt(const String& json, const String& key, int fallback) {
  String needle = "\"" + key + "\"";
  int keyPos = json.indexOf(needle);
  if (keyPos < 0) return fallback;
  int colon = json.indexOf(':', keyPos + needle.length());
  if (colon < 0) return fallback;
  int start = colon + 1;
  while (start < (int)json.length() && isspace(json.charAt(start))) start++;
  int end = start;
  while (end < (int)json.length()) {
    char c = json.charAt(end);
    if (!isdigit(c) && c != '-') break;
    end++;
  }
  if (end <= start) return fallback;
  return json.substring(start, end).toInt();
}

bool readJsonBool(const String& json, const String& key, bool fallback) {
  String needle = "\"" + key + "\"";
  int keyPos = json.indexOf(needle);
  if (keyPos < 0) return fallback;
  int colon = json.indexOf(':', keyPos + needle.length());
  if (colon < 0) return fallback;
  int start = colon + 1;
  while (start < (int)json.length() && isspace(json.charAt(start))) start++;
  if (json.startsWith("true", start)) return true;
  if (json.startsWith("false", start)) return false;
  if (json.charAt(start) == '1') return true;
  if (json.charAt(start) == '0') return false;

  String asString = readJsonString(json, key);
  asString.toLowerCase();
  return asString == "true" || asString == "1" || asString == "on";
}

String requestValue(const String& key) {
  if (server.hasArg(key)) return server.arg(key);
  if (!server.hasArg("plain")) return "";
  return readJsonString(server.arg("plain"), key);
}

bool requestBool(const String& key, bool fallback) {
  String value = requestValue(key);
  if (value.length() == 0) return fallback;
  value.toLowerCase();
  return value == "1" || value == "true" || value == "on" || value == "yes";
}

String normalizePinName(String value, const String& fallback) {
  value.trim();
  value.toUpperCase();
  for (size_t i = 0; i < sizeof(SAFE_PIN_OPTIONS) / sizeof(SAFE_PIN_OPTIONS[0]); i++) {
    if (value == SAFE_PIN_OPTIONS[i].name) return value;
  }
  return fallback;
}

uint8_t gpioForPinName(const String& pinName, uint8_t fallback) {
  for (size_t i = 0; i < sizeof(SAFE_PIN_OPTIONS) / sizeof(SAFE_PIN_OPTIONS[0]); i++) {
    if (pinName == SAFE_PIN_OPTIONS[i].name) return SAFE_PIN_OPTIONS[i].gpio;
  }
  return fallback;
}

int relayOnLevel() {
  return config.relayActiveLow ? LOW : HIGH;
}

int relayOffLevel() {
  return config.relayActiveLow ? HIGH : LOW;
}

int triggerActiveLevel() {
  return config.triggerActiveLow ? LOW : HIGH;
}

uint8_t relayGpio() {
  return gpioForPinName(config.relayPinName, D1);
}

uint8_t triggerGpio() {
  return gpioForPinName(config.triggerPinName, D2);
}

void sanitizePinConfig() {
  config.relayPinName = normalizePinName(config.relayPinName, DEFAULT_RELAY_PIN_NAME);
  config.triggerPinName = normalizePinName(config.triggerPinName, DEFAULT_TRIGGER_PIN_NAME);
  if (config.relayPinName == config.triggerPinName) {
    config.relayPinName = DEFAULT_RELAY_PIN_NAME;
    config.triggerPinName = DEFAULT_TRIGGER_PIN_NAME;
  }
}

bool loadConfig() {
  if (!LittleFS.exists(CONFIG_PATH)) return false;
  File file = LittleFS.open(CONFIG_PATH, "r");
  if (!file) return false;
  String json = file.readString();
  file.close();

  config.ssid = readJsonString(json, "ssid");
  config.password = readJsonString(json, "password");
  config.useDhcp = false;
  config.staticIp = readJsonString(json, "staticIp");
  config.gateway = readJsonString(json, "gateway");
  config.subnet = readJsonString(json, "subnet");
  config.dns1 = readJsonString(json, "dns1");
  config.dns2 = readJsonString(json, "dns2");
  config.adminPassword = readJsonString(json, "adminPassword");
  if (config.adminPassword.length() == 0) {
    config.adminPassword = "admin";
  }
  config.relayPinName = readJsonString(json, "relayPin");
  config.triggerPinName = readJsonString(json, "triggerPin");
  config.relayActiveLow = readJsonBool(json, "relayActiveLow", true);
  config.triggerActiveLow = readJsonBool(json, "triggerActiveLow", true);
  sanitizePinConfig();
  chargeOnPercent = constrain(readJsonInt(json, "chargeOnPercent", chargeOnPercent), 0, 99);
  chargeOffPercent = constrain(readJsonInt(json, "chargeOffPercent", chargeOffPercent), chargeOnPercent + 1, 100);
  config.ssid.trim();
  return config.ssid.length() > 0;
}

bool saveConfig() {
  File file = LittleFS.open(CONFIG_PATH, "w");
  if (!file) return false;
  file.print("{\n");
  file.print("  \"ssid\":\""); file.print(jsonEscape(config.ssid)); file.print("\",\n");
  file.print("  \"password\":\""); file.print(jsonEscape(config.password)); file.print("\",\n");
  file.print("  \"adminPassword\":\""); file.print(jsonEscape(config.adminPassword)); file.print("\",\n");
  file.print("  \"relayPin\":\""); file.print(jsonEscape(config.relayPinName)); file.print("\",\n");
  file.print("  \"triggerPin\":\""); file.print(jsonEscape(config.triggerPinName)); file.print("\",\n");
  file.print("  \"relayActiveLow\":"); file.print(config.relayActiveLow ? "true" : "false"); file.print(",\n");
  file.print("  \"triggerActiveLow\":"); file.print(config.triggerActiveLow ? "true" : "false"); file.print(",\n");
  file.print("  \"useDhcp\":"); file.print(config.useDhcp ? "true" : "false"); file.print(",\n");
  file.print("  \"staticIp\":\""); file.print(jsonEscape(config.staticIp)); file.print("\",\n");
  file.print("  \"gateway\":\""); file.print(jsonEscape(config.gateway)); file.print("\",\n");
  file.print("  \"subnet\":\""); file.print(jsonEscape(config.subnet)); file.print("\",\n");
  file.print("  \"dns1\":\""); file.print(jsonEscape(config.dns1)); file.print("\",\n");
  file.print("  \"dns2\":\""); file.print(jsonEscape(config.dns2)); file.print("\",\n");
  file.print("  \"chargeOnPercent\":"); file.print(chargeOnPercent); file.print(",\n");
  file.print("  \"chargeOffPercent\":"); file.print(chargeOffPercent); file.print("\n");
  file.print("}\n");
  file.close();
  return true;
}

void scheduleReboot(unsigned long delayMs) {
  rebootPending = true;
  rebootAtMs = millis() + delayMs;
}

String uptimeText() {
  unsigned long seconds = millis() / 1000UL;
  unsigned long days = seconds / 86400UL;
  seconds %= 86400UL;
  unsigned int hours = seconds / 3600UL;
  seconds %= 3600UL;
  unsigned int minutes = seconds / 60UL;
  unsigned int secs = seconds % 60UL;

  char buffer[28];
  if (days > 0) {
    snprintf(buffer, sizeof(buffer), "%lud %02u:%02u:%02u", days, hours, minutes, secs);
  } else {
    snprintf(buffer, sizeof(buffer), "%02u:%02u:%02u", hours, minutes, secs);
  }
  return String(buffer);
}

String contentTypeFor(const String& path) {
  if (path.endsWith(".html")) return "text/html";
  if (path.endsWith(".css")) return "text/css";
  if (path.endsWith(".js")) return "application/javascript";
  if (path.endsWith(".json")) return "application/json";
  if (path.endsWith(".png")) return "image/png";
  if (path.endsWith(".jpg")) return "image/jpeg";
  if (path.endsWith(".ico")) return "image/x-icon";
  return "text/plain";
}

bool serveFile(String path) {
  if (path.endsWith("/")) path += "index.html";
  if (!LittleFS.exists(path)) return false;
  File file = LittleFS.open(path, "r");
  if (!file) return false;
  server.sendHeader("Cache-Control", "no-store");
  server.streamFile(file, contentTypeFor(path));
  file.close();
  return true;
}

void sendJson(int status, const String& body) {
  server.sendHeader("Cache-Control", "no-store");
  server.send(status, "application/json", body);
}

void startApMode() {
  WiFi.disconnect();
  delay(100);
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAPConfig(AP_IP, AP_GATEWAY, AP_SUBNET);
  WiFi.softAP(AP_SSID, AP_PASS);
  currentMode = "AP";
  currentIp = WiFi.softAPIP().toString();
  currentSsid = "";
  Serial.println("WIFI_AP_STARTED");
}

bool applyStaticConfig() {
  IPAddress localIp;
  IPAddress gateway;
  IPAddress subnet;
  IPAddress dns1;
  IPAddress dns2;

  if (!localIp.fromString(config.staticIp)) return false;
  if (!gateway.fromString(config.gateway)) return false;
  if (!subnet.fromString(config.subnet)) return false;
  if (!dns1.fromString(config.dns1)) dns1 = gateway;
  if (!dns2.fromString(config.dns2)) dns2 = dns1;
  return WiFi.config(localIp, gateway, subnet, dns1, dns2);
}

