itsmejay18/Piso-Power-Station-Project-ESP32-IOT/byg_pisotab_esp8266/build/esp8266.esp8266.nodemcuv2/sketch/byg_pisotab_esp8266.ino.cpp
bool isValidIpString(const String& value) {
  IPAddress parsed;
  return parsed.fromString(value);
}

uint32_t ipToUint32(const IPAddress& ip) {
  return ((uint32_t)ip[0] << 24) | ((uint32_t)ip[1] << 16) | ((uint32_t)ip[2] << 8) | (uint32_t)ip[3];
}

String derivePortalIpFromGateway(const String& gatewayValue) {
  IPAddress gateway;
  if (!gateway.fromString(gatewayValue)) return "";
  uint8_t lastByte = gateway[3] == 100 ? 101 : 100;
  String derived = String(gateway[0]);
  derived += ".";
  derived += String(gateway[1]);
  derived += ".";
  derived += String(gateway[2]);
  derived += ".";
  derived += String(lastByte);
  return derived;
}

bool isValidSubnetMaskString(const String& value) {
  IPAddress subnet;
  if (!subnet.fromString(value)) return false;
  uint32_t mask = ipToUint32(subnet);
  if (mask == 0) return false;
  uint32_t inverted = ~mask;
  return (inverted & (inverted + 1)) == 0;
}

bool isSameSubnet(const String& localValue, const String& gatewayValue, const String& subnetValue) {
  IPAddress localIp;
  IPAddress gateway;
  IPAddress subnet;
  if (!localIp.fromString(localValue)) return false;
  if (!gateway.fromString(gatewayValue)) return false;
  if (!subnet.fromString(subnetValue)) return false;
  uint32_t mask = ipToUint32(subnet);
  return (ipToUint32(localIp) & mask) == (ipToUint32(gateway) & mask);
}

void startStaOrFallback() {
  Serial.println("WIFI_STA_CONNECTING");
  WiFi.disconnect();
  delay(100);
  WiFi.mode(WIFI_STA);
  WiFi.hostname("BYG-PISOTAB-PRO");
  applyStaticConfig();
  WiFi.begin(config.ssid.c_str(), config.password.c_str());

  unsigned long started = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - started < STA_TIMEOUT_MS) {
    delay(250);
    yield();
  }

  if (WiFi.status() == WL_CONNECTED) {
    currentMode = "STA";
    currentIp = WiFi.localIP().toString();
    currentSsid = WiFi.SSID();
    Serial.println("WIFI_STA_CONNECTED");
  } else {
    Serial.println("WIFI_STA_FAILED_FALLBACK_AP");
    startApMode();
  }
}

bool readAllanTriggerRaw() {
  return digitalRead(triggerGpio()) == triggerActiveLevel();
}

void updateAllanTrigger() {
  bool rawActive = readAllanTriggerRaw();
  if (rawActive != allanRawActive) {
    allanRawActive = rawActive;
    allanRawChangedMs = millis();
  }
  if (rawActive != allanTriggerActive
      && millis() - allanRawChangedMs >= ALLAN_TRIGGER_DEBOUNCE_MS) {
    allanTriggerActive = rawActive;
    Serial.println(allanTriggerActive ? "ALLAN_TRIGGER_ON" : "ALLAN_TRIGGER_OFF");
  }
}

void handleStatus() {
  updateAllanTrigger();
  String body = "{";
  body += "\"ok\":true,";
  body += "\"board\":\""; body += BOARD_NAME; body += "\",";
  body += "\"mode\":\""; body += currentMode; body += "\",";
  body += "\"ip\":\""; body += jsonEscape(currentIp); body += "\",";
  body += "\"ssid\":\""; body += jsonEscape(currentSsid); body += "\",";
  body += "\"useDhcp\":"; body += (config.useDhcp ? "true" : "false"); body += ",";
  body += "\"uptime\":\""; body += uptimeText(); body += "\",";
  body += "\"freeHeap\":"; body += String(ESP.getFreeHeap()); body += ",";
  body += "\"battery\":"; body += String(batteryPercent); body += ",";
  body += "\"charging\":\""; body += (charging ? "ON" : "OFF"); body += "\",";
  body += "\"allanTrigger\":"; body += (allanTriggerActive ? "true" : "false"); body += ",";
  body += "\"session\":\""; body += (allanTriggerActive ? "ACTIVE" : "OFF"); body += "\",";
  body += "\"relayPin\":\""; body += jsonEscape(config.relayPinName); body += "\",";
  body += "\"triggerPin\":\""; body += jsonEscape(config.triggerPinName); body += "\",";
  body += "\"relayActiveLevel\":\""; body += (config.relayActiveLow ? "LOW" : "HIGH"); body += "\",";
  body += "\"triggerActiveLevel\":\""; body += (config.triggerActiveLow ? "LOW" : "HIGH"); body += "\",";
  body += "\"chargeOnPercent\":"; body += String(chargeOnPercent); body += ",";
  body += "\"chargeOffPercent\":"; body += String(chargeOffPercent);
  body += "}";
  sendJson(200, body);
}

String chargingStatusJson() {
  String body = "{";
  body += "\"ok\":true,";
  body += "\"battery\":"; body += String(batteryPercent); body += ",";
  body += "\"charging\":\""; body += (charging ? "ON" : "OFF"); body += "\",";
  body += "\"allanTrigger\":"; body += (allanTriggerActive ? "true" : "false"); body += ",";
  body += "\"session\":\""; body += (allanTriggerActive ? "ACTIVE" : "OFF"); body += "\",";
  body += "\"charge_on_percent\":"; body += String(chargeOnPercent); body += ",";
  body += "\"charge_off_percent\":"; body += String(chargeOffPercent); body += ",";
  body += "\"relay\":\""; body += (charging ? "ON" : "OFF"); body += "\"";
  body += "}";
  return body;
}

void turnChargingOn() {
  if (charging) return;
  charging = true;
  digitalWrite(relayGpio(), relayOnLevel());
  Serial.println("CHARGING_ON");
}

void turnChargingOff() {
  if (!charging) return;
  charging = false;
  digitalWrite(relayGpio(), relayOffLevel());
  Serial.println("CHARGING_OFF");
}

void smartChargingLogic() {
  if (batteryPercent < 0) return;
  if (batteryPercent <= chargeOnPercent && !charging) {
    turnChargingOn();
  }
  if (batteryPercent >= chargeOffPercent && charging) {
    turnChargingOff();
  }
}

void handleBattery() {
  int nextBattery = -1;
  if (server.hasArg("battery")) {
    nextBattery = server.arg("battery").toInt();
  } else if (server.hasArg("percent")) {
    nextBattery = server.arg("percent").toInt();
  } else if (server.hasArg("plain")) {
    String plain = server.arg("plain");
    nextBattery = readJsonInt(plain, "battery", -1);
    if (nextBattery < 0) {
      String raw = readJsonString(plain, "battery");
      if (raw.length() > 0) nextBattery = raw.toInt();
    }
  }
  if (nextBattery < 0 || nextBattery > 100) {
    sendJson(400, "{\"ok\":false,\"error\":\"Missing battery\"}");
    return;
  }
  batteryPercent = constrain(nextBattery, 0, 100);
  Serial.print("BATTERY_RECEIVED:");
  Serial.println(batteryPercent);
  smartChargingLogic();
  sendJson(200, chargingStatusJson());
}

void handleApiBattery() {
  handleBattery();
}

void handleChargingSettings() {
  if (server.hasArg("on")) {
    chargeOnPercent = constrain(server.arg("on").toInt(), 0, 99);
  }
  if (server.hasArg("off")) {
    chargeOffPercent = constrain(server.arg("off").toInt(), chargeOnPercent + 1, 100);
  }
  if (chargeOffPercent <= chargeOnPercent) {
    chargeOffPercent = min(100, chargeOnPercent + 1);
  }
  saveConfig();
  sendJson(200, chargingStatusJson());
  scheduleReboot(1000);
}

