itsmejay18/Piso-Power-Station-Project-ESP32-IOT/byg_pisotab_esp8266/build/esp8266.esp8266.nodemcuv2/sketch/byg_pisotab_esp8266.ino.cpp
void handleChargeApi() {
  if (!server.hasArg("on") || !server.hasArg("off")) {
    sendJson(400, "{\"ok\":false,\"message\":\"Resume and stop percentages are required\"}");
    return;
  }
  int nextOn = constrain(server.arg("on").toInt(), 0, 99);
  int nextOff = constrain(server.arg("off").toInt(), 1, 100);
  if (nextOff <= nextOn) {
    sendJson(400, "{\"ok\":false,\"message\":\"Stop percent must be higher than resume percent\"}");
    return;
  }
  chargeOnPercent = nextOn;
  chargeOffPercent = nextOff;
  smartChargingLogic();
  if (!saveConfig()) {
    sendJson(500, "{\"ok\":false,\"message\":\"Failed to save smart charging\"}");
    return;
  }
  sendJson(200, chargingStatusJson());
  scheduleReboot(1000);
}

void handleChargingStatus() {
  sendJson(200, chargingStatusJson());
}

void handleScan() {
  if (currentMode == "AP") {
    WiFi.mode(WIFI_AP_STA);
  }
  int count = WiFi.scanNetworks(false, true);
  if (count < 0) {
    sendJson(503, "{\"ok\":false,\"message\":\"WiFi scan is busy. Try again.\"}");
    return;
  }
  String body = "[";
  for (int i = 0; i < count; i++) {
    if (i > 0) body += ",";
    body += "{";
    body += "\"ssid\":\""; body += jsonEscape(WiFi.SSID(i)); body += "\",";
    body += "\"rssi\":"; body += String(WiFi.RSSI(i)); body += ",";
    body += "\"channel\":"; body += String(WiFi.channel(i)); body += ",";
    body += "\"secure\":"; body += (WiFi.encryptionType(i) == ENC_TYPE_NONE ? "false" : "true");
    body += "}";
  }
  body += "]";
  WiFi.scanDelete();
  sendJson(200, body);
}

void handleLogin() {
  String username = requestValue("username");
  String password = requestValue("password");
  if (username == "admin" && password == config.adminPassword) {
    Serial.println("LOGIN_SUCCESS");
    sendJson(200, "{\"ok\":true}");
  } else {
    Serial.println("LOGIN_FAILED");
    sendJson(401, "{\"ok\":false,\"message\":\"Invalid username or password\"}");
  }
}

void handlePasswordChange() {
  String currentPassword = requestValue("currentPassword");
  String newPassword = requestValue("newPassword");

  if (newPassword.length() < 4) {
    sendJson(400, "{\"ok\":false,\"message\":\"New password must be at least 4 characters\"}");
    return;
  }
  if (currentPassword != config.adminPassword) {
    sendJson(401, "{\"ok\":false,\"message\":\"Current password is incorrect\"}");
    return;
  }

  config.adminPassword = newPassword;
  if (!saveConfig()) {
    sendJson(500, "{\"ok\":false,\"message\":\"Failed to save password\"}");
    return;
  }

  Serial.println("PASSWORD_CHANGED");
  sendJson(200, "{\"ok\":true,\"message\":\"Password changed\"}");
}

void handlePins() {
  String relayPinName = normalizePinName(requestValue("relayPin"), "");
  String triggerPinName = normalizePinName(requestValue("triggerPin"), "");
  String relayActiveLevel = requestValue("relayActiveLevel");
  String triggerActiveLevelValue = requestValue("triggerActiveLevel");
  relayActiveLevel.trim();
  triggerActiveLevelValue.trim();
  relayActiveLevel.toUpperCase();
  triggerActiveLevelValue.toUpperCase();

  if (relayPinName.length() == 0 || triggerPinName.length() == 0) {
    sendJson(400, "{\"ok\":false,\"message\":\"Choose safe pins only: D1, D2, D5, D6, D7\"}");
    return;
  }
  if (relayPinName == triggerPinName) {
    sendJson(400, "{\"ok\":false,\"message\":\"Relay pin and Allan trigger pin must be different\"}");
    return;
  }
  if (relayActiveLevel != "LOW" && relayActiveLevel != "HIGH") {
    sendJson(400, "{\"ok\":false,\"message\":\"Relay active level must be LOW or HIGH\"}");
    return;
  }
  if (triggerActiveLevelValue != "LOW" && triggerActiveLevelValue != "HIGH") {
    sendJson(400, "{\"ok\":false,\"message\":\"Trigger active level must be LOW or HIGH\"}");
    return;
  }

  config.relayPinName = relayPinName;
  config.triggerPinName = triggerPinName;
  config.relayActiveLow = relayActiveLevel == "LOW";
  config.triggerActiveLow = triggerActiveLevelValue == "LOW";
  sanitizePinConfig();

  if (!saveConfig()) {
    sendJson(500, "{\"ok\":false,\"message\":\"Failed to save pin config\"}");
    return;
  }

  Serial.println("PIN_CONFIG_SAVED");
  sendJson(200, "{\"ok\":true,\"message\":\"Pin config saved. Rebooting\"}");
  scheduleReboot(1000);
}

void handleSettings() {
  config.ssid = requestValue("ssid");
  config.password = requestValue("password");
  config.useDhcp = false;
  config.staticIp = requestValue("staticIp");
  config.gateway = requestValue("gateway");
  config.subnet = "255.255.255.0";
  config.dns1 = "";
  config.dns2 = "";
  config.ssid.trim();
  config.staticIp.trim();
  config.gateway.trim();
  config.subnet.trim();
  config.dns1.trim();
  config.dns2.trim();

  if (config.ssid.length() == 0) {
    sendJson(400, "{\"ok\":false,\"message\":\"WiFi SSID is required\"}");
    return;
  }
  if (config.staticIp.length() == 0) {
    config.staticIp = derivePortalIpFromGateway(config.gateway);
  }
  if (!isValidIpString(config.gateway)) {
    sendJson(400, "{\"ok\":false,\"message\":\"Valid gateway is required\"}");
    return;
  }
  if (!isValidIpString(config.staticIp)) {
    sendJson(400, "{\"ok\":false,\"message\":\"Valid portal IP is required\"}");
    return;
  }
  if (!isValidSubnetMaskString(config.subnet)) {
    sendJson(400, "{\"ok\":false,\"message\":\"Subnet mask must be valid\"}");
    return;
  }
  if (config.staticIp == config.gateway) {
    sendJson(400, "{\"ok\":false,\"message\":\"Portal IP and router gateway cannot be the same\"}");
    return;
  }
  if (!isSameSubnet(config.staticIp, config.gateway, config.subnet)) {
    sendJson(400, "{\"ok\":false,\"message\":\"Portal IP and router gateway must use the same network\"}");
    return;
  }

  if (!saveConfig()) {
    sendJson(500, "{\"ok\":false,\"message\":\"Failed to save config\"}");
    return;
  }

  Serial.println("SETTINGS_SAVED");
  sendJson(200, "{\"ok\":true,\"message\":\"Settings saved\"}");
}

void handleReboot() {
  Serial.println("REBOOT_REQUESTED");
  sendJson(200, "{\"ok\":true,\"message\":\"Rebooting\"}");
  scheduleReboot(800);
}

void handleReset() {
  LittleFS.remove(CONFIG_PATH);
  Serial.println("RESET_REQUESTED");
  sendJson(200, "{\"ok\":true,\"message\":\"Setup reset\"}");
  scheduleReboot(800);
}

