itsmejay18/Piso-Power-Station-Project-ESP32-IOT/byg_pisotab_esp8266/build/esp8266.esp8266.nodemcuv2/sketch/byg_pisotab_esp8266.ino.cpp
void configureIoPins() {
  sanitizePinConfig();
  charging = false;
  pinMode(relayGpio(), OUTPUT);
  digitalWrite(relayGpio(), relayOffLevel());
  pinMode(triggerGpio(), INPUT_PULLUP);
  allanRawActive = readAllanTriggerRaw();
  allanTriggerActive = allanRawActive;
  allanRawChangedMs = millis();
  Serial.print("RELAY_PIN:");
  Serial.println(config.relayPinName);
  Serial.print("ALLAN_TRIGGER_PIN:");
  Serial.println(config.triggerPinName);
  Serial.println(allanTriggerActive ? "ALLAN_TRIGGER_ON" : "ALLAN_TRIGGER_OFF");
}

void setupRoutes() {
  server.on("/battery", HTTP_GET, handleBattery);
  server.on("/settings", HTTP_GET, handleChargingSettings);
  server.on("/status", HTTP_GET, handleChargingStatus);
  server.on("/api/status", HTTP_GET, handleStatus);
  server.on("/api/battery", HTTP_POST, handleApiBattery);
  server.on("/api/scan", HTTP_GET, handleScan);
  server.on("/api/login", HTTP_POST, handleLogin);
  server.on("/api/password", HTTP_POST, handlePasswordChange);
  server.on("/api/pins", HTTP_POST, handlePins);
  server.on("/api/settings", HTTP_POST, handleSettings);
  server.on("/api/charge", HTTP_POST, handleChargeApi);
  server.on("/api/reboot", HTTP_POST, handleReboot);
  server.on("/api/reset", HTTP_POST, handleReset);
  server.onNotFound([]() {
    if (!serveFile(server.uri())) {
      sendJson(404, "{\"ok\":false,\"message\":\"Not found\"}");
    }
  });
}

void setup() {
  Serial.begin(115200);
  delay(200);
  bootMs = millis();

  if (!LittleFS.begin()) {
    LittleFS.format();
    LittleFS.begin();
  }

  bool hasConfig = loadConfig();
  configureIoPins();

  if (hasConfig) {
    startStaOrFallback();
  } else {
    startApMode();
  }

  setupRoutes();
  server.begin();
  Serial.println("PORTAL_STARTED");
}

void loop() {
  updateAllanTrigger();
  server.handleClient();
  if (rebootPending && (long)(millis() - rebootAtMs) >= 0) {
    delay(100);
    ESP.restart();
  }
}

